/* 
Практическое задание No3: прямое наследование.
Задание 1.
1.Опишите класс «Точка» на координатной плоскости.
    Данные класса: 
        координаты точки в декартовом пространстве.
    Конструкторы класса: 
        конструктор по умолчанию (начало координат), 
        конструктор произвольной точки.
2.Определите методы: 
        ввод-вывод в поток, 
        определение радиуса вектора точки.
3.Объявите объекты с использованием различных конструкторов, 
        найдите их радиусы векторы.
 */

#include <math.h>   //pow()
#include <iostream> //cin/cout и стримы
#include <iomanip>  //reserved
using namespace std;

